In [1]:
# Task 1: Data Preparation

In [2]:
# import packages
# csv module helps us to read and write data in csv format
import csv
# module for data transformation and manipulation
import numpy as np
# modules used for plotting charts
import matplotlib.pyplot as plt
from pandas.plotting import scatter_matrix

In [3]:
## Step 1:
#import file
ipfile = open('bank.csv', 'rb')
reader = csv.reader(ipfile, quoting=0, escapechar = '')

#export file
opfile =  open('bankdatadup.csv', 'wb')
writer = csv.writer(opfile, quoting=3, escapechar='', quotechar='')

# iterate though every row looking for reverse quotes and replacing, write results to output file
for row in reader:
    row = [item.replace('”', '"') for item in row]
    writer.writerow(row)
# close both import and output file
ipfile.close()
opfile.close()

In [4]:
#Import pandas to use the data utility functions
import pandas as pd

In [5]:
#Read in the new bank file, and change the headers with full stops to underscores and check if they have been changed correctly.
bankdata = pd.read_csv('bankdatadup.csv', sep = ';', doublequote=0, header=0, names=[u'age', u'job', u'marital', u'education', u'default', u'housing',
       u'loan', u'contact', u'month', u'day_of_week', u'duration', u'campaign',
       u'pdays', u'previous', u'poutcome', u'emp_var_rate', u'cons_price_idx',
       u'cons_conf_idx', u'euribor3m', u'nr_employed', u'y'])
bankdata.columns

Index([u'age', u'job', u'marital', u'education', u'default', u'housing',
       u'loan', u'contact', u'month', u'day_of_week', u'duration', u'campaign',
       u'pdays', u'previous', u'poutcome', u'emp_var_rate', u'cons_price_idx',
       u'cons_conf_idx', u'euribor3m', u'nr_employed', u'y'],
      dtype='object')

In [6]:
## Step 2:
#To check if the loaded data is equivalent to the data
#Check the data types of the dataloaded
bankdata.dtypes

age               float64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration           object
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp_var_rate      float64
cons_price_idx    float64
cons_conf_idx     float64
euribor3m         float64
nr_employed       float64
y                  object
dtype: object

In [7]:
# describe the data set
bankdata.describe()

,age,campaign,pdays,previous,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed
count,4116.000000,4119.000000,4119.000000,4119.000000,4119.000000,4116.000000,4119.000000,4117.000000,4117.000000
mean,40.188533,2.537266,960.422190,0.190337,0.084972,93.579421,-40.499102,3.621787,5166.536386
std,10.939885,2.568159,191.922786,0.541788,1.563114,0.579464,4.594578,1.733619,73.637236
min,18.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.635000,4963.600000
25%,32.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.334000,5099.100000
50%,38.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,250.000000,35.000000,999.000000,6.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

In [8]:
#From the above table we can note the following:
#1. The count values of are not uniform.
#2. The maximum value of age is observed to be 250 which is not possible.
#3. Most of the values in pdays are 999
#4. Most of the values in previous are 0
# To start with sorting out the age columns, let us discover age entires with null values
bankdata.age.isnull().describe()

count      4119
unique        2
top       False
freq       4116
Name: age, dtype: object

In [9]:
# display the rows of age containg null values.
bankdata.loc[bankdata['age'].isnull()]

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
36,NaN,blue-collar,married,basic.6y,no,yes,no,telephone,may,wed,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.859,5191.0,no
433,NaN,admin.,single,university.degree,no,yes,no,cellular,aug,thu,...,1,999,0,nonexistent,1.4,93.444,-36.1,4.963,5228.1,no
538,NaN,management,married,high.school,no,yes,no,cellular,aug,wed,...,1,999,0,nonexistent,1.4,93.444,-36.1,4.965,5228.1,no

In [10]:
# The null values in the age column are filled with the mean value of the age.
bankdata.age = bankdata.age.fillna(bankdata.age.mean())
bankdata.age.isnull().describe()

count      4119
unique        1
top       False
freq       4119
Name: age, dtype: object

In [11]:
# We noticed that the maximum value for age to be 250. 
# Create an age mask to get rid of the invalid values
ageMask = bankdata.age < 120
bankdata = bankdata[ageMask]

In [12]:
#View the corrected values
bankdata.describe()

,age,campaign,pdays,previous,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed
count,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000,4114.000000,4117.000000,4115.000000,4115.000000
mean,40.112598,2.537770,960.403449,0.190430,0.085111,93.579621,-40.498786,3.622016,5166.537813
std,10.314219,2.568658,191.967524,0.541904,1.563084,0.579502,4.594323,1.733547,73.641374
min,18.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.635000,4963.600000
25%,32.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.334000,5099.100000
50%,38.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,88.000000,35.000000,999.000000,6.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

In [13]:
#Explore duration. We can note a hypen value.
# check the data type (object)
bankdata.duration.dtype
bankdata.duration.describe()
bankdata.duration.value_counts()

77      24
112     23
73      22
81      21
83      20
122     20
113     20
90      20
145     20
135     19
88      19
131     19
114     19
103     18
107     18
155     18
159     18
87      18
95      17
102     17
204     17
147     17
180     17
111     17
161     17
160     17
130     17
69      17
139     17
126     16
        ..
838      1
775      1
366      1
696      1
693      1
1114     1
-        1
868      1
1167     1
867      1
764      1
882      1
881      1
886      1
888      1
1150     1
739      1
325      1
662      1
776      1
771      1
770      1
1386     1
1046     1
479      1
1119     1
667      1
1149     1
663      1
3253     1
Name: duration, Length: 829, dtype: int64

In [14]:
# display the affected observations for report
bankdata.loc[bankdata['duration'] == '-']

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
678,39.0,blue-collar,married,basic.6y,no,no,no,telephone,may,thu,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no

In [15]:
# replace the hyphen with NaN
bankdata.duration = bankdata.duration.replace('-',np.nan)

In [16]:
#Convert the data type to numeric
bankdata.duration = bankdata.duration.apply(pd.to_numeric)
bankdata.duration.dtype

dtype('float64')

In [17]:
## Step 3:
## To fix typos
#Let us explore the job column
bankdata.job.value_counts()

admin.           1011
blue-collar       884
technician        691
services          393
management        324
retired           166
self-employed     159
entrepreneur      148
housemaid         110
unemployed        110
student            82
unknown            39
Name: job, dtype: int64

In [18]:
#Replace 'admin.' to admin to avoid errors
bankdata.job = bankdata.job.replace('admin.', 'admin')
bankdata.job.value_counts()

admin            1011
blue-collar       884
technician        691
services          393
management        324
retired           166
self-employed     159
entrepreneur      148
housemaid         110
unemployed        110
student            82
unknown            39
Name: job, dtype: int64

In [19]:
# Let us explore the marital column
bankdata.marital.value_counts()

married       2507
single        1153
divorced       445
unknown         11
divorceded       1
Name: marital, dtype: int64

In [20]:
#We can observe that there is a typo for the divorced value. Let us replace that with the correct value 
bankdata.marital = bankdata.marital.replace('divorceded', 'divorced')

In [21]:
#View the corrected values
bankdata.marital.value_counts()

married     2507
single      1153
divorced     446
unknown       11
Name: marital, dtype: int64

In [22]:
# look at education value counts
# basic.6yes is similar to basic.6y and can possibly be a typo.
bankdata.education.value_counts()

university.degree      1264
high.school             921
basic.9y                573
professional.course     535
basic.4y                428
basic.6y                227
unknown                 167
basic.6yes                1
illiterate                1
Name: education, dtype: int64

In [23]:
# replace the 6yes with 6y
bankdata.education = bankdata.education.replace('basic.6yes','basic.6y')
bankdata.education.value_counts()

university.degree      1264
high.school             921
basic.9y                573
professional.course     535
basic.4y                428
basic.6y                228
unknown                 167
illiterate                1
Name: education, dtype: int64

In [24]:
# Replace full stops in the name to underscores
bankdata.education = bankdata.education.replace('university.degree', 'university_degree')
bankdata.education = bankdata.education.replace('high.school', 'high_school')
bankdata.education = bankdata.education.replace('basic.9y', 'basic_9y')
bankdata.education = bankdata.education.replace('professional.course', 'professional_course')
bankdata.education = bankdata.education.replace('basic.4y', 'basic_4y')
bankdata.education = bankdata.education.replace('basic.6y', 'basic_6y')

In [25]:
# View the changed Values
bankdata.education.value_counts()

university_degree      1264
high_school             921
basic_9y                573
professional_course     535
basic_4y                428
basic_6y                228
unknown                 167
illiterate                1
Name: education, dtype: int64

In [26]:
# Next we explore housing column and we can see that there is a typo 'yess'
bankdata.housing.value_counts()

yes        2174
no         1837
unknown     105
yess          1
Name: housing, dtype: int64

In [27]:
# Replace the typo 'yess' to 'yes' and view the data
bankdata.housing = bankdata.housing.replace('yess','yes')
bankdata.housing.value_counts()

yes        2175
no         1837
unknown     105
Name: housing, dtype: int64

In [28]:
# review the columns again
bankdata.columns

Index([u'age', u'job', u'marital', u'education', u'default', u'housing',
       u'loan', u'contact', u'month', u'day_of_week', u'duration', u'campaign',
       u'pdays', u'previous', u'poutcome', u'emp_var_rate', u'cons_price_idx',
       u'cons_conf_idx', u'euribor3m', u'nr_employed', u'y'],
      dtype='object')

In [29]:
# Explore loans. We can observe that there are no changes required.
bankdata.loan.value_counts()

no         3347
yes         665
unknown     105
Name: loan, dtype: int64

In [30]:
# Explore loans. We can observe that there are no changes required.
bankdata.contact.value_counts()

cellular     2650
telephone    1467
Name: contact, dtype: int64

In [31]:
#Explore months. No changes needed as all values seem valid.
bankdata.month.value_counts()

may    1377
jul     711
aug     635
jun     530
nov     446
apr     215
oct      69
sep      64
mar      48
dec      22
Name: month, dtype: int64

In [32]:
#Explore weeks. No changes needed as all values seem valid.
bankdata.day_of_week.value_counts()

thu    859
mon    855
tue    841
wed    794
fri    768
Name: day_of_week, dtype: int64

In [33]:
#Explore default. There is a typo with value 'noo' that needs to be corrected.
bankdata.default.value_counts()

no         3312
unknown     803
noo           1
yes           1
Name: default, dtype: int64

In [34]:
#Correct typo and view the results.
bankdata.default = bankdata.default.replace('noo','no')
bankdata.default.value_counts()

no         3313
unknown     803
yes           1
Name: default, dtype: int64

In [35]:
#Explore y. No errors found. Values seem correct.
bankdata.y.value_counts()

no     3666
yes     451
Name: y, dtype: int64

In [36]:
## Step 4:
#Remove any whitespaces
for i in ['job', 'marital', 'education', 'loan', 'default', 'housing', 'contact', 'month', 'day_of_week']:
    bankdata[i] = bankdata[i].str.strip()

In [37]:
#Convert into lowercase
for i in ['job', 'marital', 'education', 'loan', 'default', 'housing', 'contact', 'month', 'day_of_week']:
    bankdata[i] = bankdata[i].str.lower()
bankdata.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
0,30.0,blue-collar,married,basic_9y,no,yes,no,cellular,may,fri,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39.0,services,single,high_school,no,no,no,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25.0,services,married,high_school,no,yes,no,telephone,jun,wed,...,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38.0,services,married,basic_9y,no,unknown,unknown,telephone,jun,fri,...,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47.0,admin,married,university_degree,no,yes,no,cellular,nov,mon,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [38]:
## Step 5:
#Sanity Checks
bankdata.describe()

,age,duration,campaign,pdays,previous,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed
count,4117.000000,4116.000000,4117.000000,4117.000000,4117.000000,4117.000000,4114.000000,4117.000000,4115.000000,4115.000000
mean,40.112598,256.830904,2.537770,960.403449,0.190430,0.085111,93.579621,-40.498786,3.622016,5166.537813
std,10.314219,254.764154,2.568658,191.967524,0.541904,1.563084,0.579502,4.594323,1.733547,73.641374
min,18.000000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.635000,4963.600000
25%,32.000000,103.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.334000,5099.100000
50%,38.000000,181.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.000000,317.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,88.000000,3643.000000,35.000000,999.000000,6.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

In [39]:
#Check age. age >= 18 < 120.
bankdata.loc[(bankdata['age'] < 18) | (bankdata['age'] > 120)]

Empty DataFrame
Columns: [age, job, marital, education, default, housing, loan, contact, month, day_of_week, duration, campaign, pdays, previous, poutcome, emp_var_rate, cons_price_idx, cons_conf_idx, euribor3m, nr_employed, y]
Index: []

[0 rows x 21 columns]

In [40]:
# display all the rows where duration is 0 and y is 'yes' failing the business rule given
bankdata.loc[(bankdata['duration'] == 0) & (bankdata['y'] == 'yes')]

Empty DataFrame
Columns: [age, job, marital, education, default, housing, loan, contact, month, day_of_week, duration, campaign, pdays, previous, poutcome, emp_var_rate, cons_price_idx, cons_conf_idx, euribor3m, nr_employed, y]
Index: []

[0 rows x 21 columns]

In [41]:
# print the rows with NaN values for report
for i in ['duration', 'euribor3m', 'cons_price_idx', 'nr_employed'] :
    print (bankdata[i].loc[bankdata[i].isnull()])

678   NaN
Name: duration, dtype: float64
44    NaN
193   NaN
Name: euribor3m, dtype: float64
77    NaN
249   NaN
303   NaN
Name: cons_price_idx, dtype: float64
21   NaN
30   NaN
Name: nr_employed, dtype: float64

In [42]:
#Step 7:
#replace nul values with column means
bankdata.duration = bankdata.duration.fillna(bankdata.duration.mean())
bankdata.euribor3m = bankdata.euribor3m.fillna(bankdata.euribor3m.mean())
bankdata.cons_price_idx = bankdata.cons_price_idx.fillna(bankdata.cons_price_idx.mean())
bankdata.nr_employed = bankdata.nr_employed.fillna(bankdata.nr_employed.mean())

In [43]:
bankdata.describe()

,age,duration,campaign,pdays,previous,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed
count,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000,4117.000000
mean,40.112598,256.830904,2.537770,960.403449,0.190430,0.085111,93.579621,-40.498786,3.622016,5166.537813
std,10.314219,254.733204,2.568658,191.967524,0.541904,1.563084,0.579291,4.594323,1.733125,73.623481
min,18.000000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.635000,4963.600000
25%,32.000000,103.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.334000,5099.100000
50%,38.000000,181.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.000000,317.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,88.000000,3643.000000,35.000000,999.000000,6.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

In [44]:
bankdata.to_csv("cleanbankdata.csv", encoding = 'utf-8')